example usage:

./a.aut

todo_list:> add example task

    Добавлена задача: example task
    1: example task

todo_list:> add example task 2

    Добавлена задача: example task 2
    1: example task
    2: example task 2

todo_list:> com 1

    1: example task ✓
    2: example task 2

todo_list:> del 1

    1: example task 2

or > cc main.c
next the same

commands: add {text task}; com {number of task}; del {num of task}

